CommunityGD32Cores/ArduinoCore-GD32/cores/arduino/gd32/timer.c
    timer_enable(periph);
    timer_channel_output_state_config(pwmDevice->timer, pwmDevice->channel, TIMER_CCX_DISABLE);
}

/*!
    \brief      start pwm output
    \param[in]  pwmDevice: pwm device
    \param[out] none
    \retval     none
*/
void PWM_start(pwmDevice_t *pwmDevice)
{
    timer_channel_output_state_config(pwmDevice->timer, pwmDevice->channel, TIMER_CCX_ENABLE);
}

/*!
    \brief      stop pwm output
    \param[in]  pwmDevice: pwm device
    \param[out] none
    \retval     none
*/
void PWM_stop(pwmDevice_t *pwmDevice)
{
    timer_channel_output_state_config(pwmDevice->timer, pwmDevice->channel, TIMER_CCX_DISABLE);
}

/*!
    \brief      set pwm period and cycle
    \param[in]  pwmDevice: pwm device
    \param[in]  pwmPeriodCycle: pwm period and cycle
    \param[out] none
    \retval     none
*/
void PWM_setPeriodCycle(pwmDevice_t *pwmDevice, pwmPeriodCycle_t *pwmPeriodCycle)
{
    uint32_t ccvalue = 0;
    uint32_t prescalerfactor = 0;
    uint32_t period_cycle = 0;
    timer_parameter_struct timer_initpara;
    switch (pwmPeriodCycle->format) {
        case FORMAT_US:
            timer_initpara.prescaler = getTimerClkFrequency(pwmDevice->timer) / 1000000 - 1;
            timer_initpara.period = pwmPeriodCycle->period - 1;
            timer_initpara.repetitioncounter = 0;
            ccvalue = pwmPeriodCycle->cycle;
            break;
        case FORMAT_MS:
            timer_initpara.prescaler = getTimerClkFrequency(pwmDevice->timer) / 10000 - 1;
            timer_initpara.period = pwmPeriodCycle->period * 10 - 1;
            timer_initpara.repetitioncounter = 0;
            ccvalue = pwmPeriodCycle->cycle * 10;
            break;
        case FORMAT_S:
            timer_initpara.prescaler = getTimerClkFrequency(pwmDevice->timer) / 10000 - 1;
            timer_initpara.period = pwmPeriodCycle->period * 40;
            timer_initpara.repetitioncounter = 250;
            ccvalue = pwmPeriodCycle->cycle * 40;
            break;
        case FORMAT_HZ:
            period_cycle = getTimerClkFrequency(pwmDevice->timer) / pwmPeriodCycle->period;
            prescalerfactor = (period_cycle / 65536) + 1;
            timer_initpara.prescaler = prescalerfactor - 1;
            timer_initpara.period = period_cycle / prescalerfactor;
            timer_initpara.repetitioncounter  = 0;
            ccvalue = pwmPeriodCycle->cycle * (timer_initpara.period + 1) / 100.0 ;
            break;
        default:
            break;
    }
    timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
    timer_initpara.counterdirection = TIMER_COUNTER_UP;
    timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
    timer_init(pwmDevice->timer, &timer_initpara);
    timer_channel_output_pulse_value_config(pwmDevice->timer, pwmDevice->channel, ccvalue - 1);
}

/*!
    \brief      set pwm  cycle
    \param[in]  pwmDevice: pwm device
    \param[in]  pwmPeriodCycle: pwm period and cycle
    \param[out] none
    \retval     none
*/
void PWM_writeCyclevalue(pwmDevice_t *pwmDevice, pwmPeriodCycle_t *pwmPeriodCycle)
{
    uint32_t value ;

    switch (pwmPeriodCycle->format) {
        case FORMAT_US:
            value = pwmPeriodCycle->cycle;
            break;
        case FORMAT_MS:
            value = pwmPeriodCycle->cycle * 10;
            break;
        case FORMAT_S:
            value = pwmPeriodCycle->cycle * 40;
            break;
        case FORMAT_HZ:
            value = pwmPeriodCycle->cycle / 100.0 * (TIMER_CAR(pwmDevice->timer) + 1);
            break;
        default:
            //ToDo: better error handling in case of invalid params
            return;
    }
    timer_channel_output_pulse_value_config(pwmDevice->timer, pwmDevice->channel, value - 1);
}

/*!
    \brief      enable pwm interrupt
    \param[in]  pwmDevice: pwm device
    \param[out] none
    \retval     none
*/
void PWM_enablePWMIT(pwmDevice_t *pwmDevice)
{
    uint32_t interrupt;
    uint32_t interrupt_flag;
    uint16_t ch = pwmDevice->channel;
    switch (ch) {
        case 0:
            interrupt = TIMER_INT_CH0;
            interrupt_flag = TIMER_INT_FLAG_CH0;
            break;
        case 1:
            interrupt = TIMER_INT_CH1;
            interrupt_flag = TIMER_INT_FLAG_CH1;
            break;
        case 2:
            interrupt = TIMER_INT_CH2;
            interrupt_flag = TIMER_INT_FLAG_CH2;
            break;
        case 3:
            interrupt = TIMER_INT_CH3;
            interrupt_flag = TIMER_INT_FLAG_CH3;
            break;
        default:
            //ToDo: better error handling in case of invalid params
            return;
    }
    timer_interrupt_flag_clear(pwmDevice->timer, interrupt_flag);
    timer_interrupt_enable(pwmDevice->timer, interrupt);
}

/*!
    \brief      disable pwm interrupt
    \param[in]  pwmDevice: pwm device
    \param[out] none
    \retval     none
*/
void PWM_disablePWMIT(pwmDevice_t *pwmDevice)
{
    uint32_t interrupt;
    uint32_t interrupt_flag;
    uint16_t ch = pwmDevice->channel;
    switch (ch) {
        case 0:
            interrupt = TIMER_INT_CH0;
            interrupt_flag = TIMER_INT_FLAG_CH0;
            break;
        case 1:
            interrupt = TIMER_INT_CH1;
            interrupt_flag = TIMER_INT_FLAG_CH1;
            break;
        case 2:
            interrupt = TIMER_INT_CH2;
            interrupt_flag = TIMER_INT_FLAG_CH2;
            break;
        case 3:
            interrupt = TIMER_INT_CH3;
            interrupt_flag = TIMER_INT_FLAG_CH3;
            break;
        default:
            //ToDo: better error handling in case of invalid params
            return;
    }
    timer_interrupt_flag_clear(pwmDevice->timer, interrupt_flag);
    timer_interrupt_disable(pwmDevice->timer, interrupt);
}

/*!
    \brief      get timer clock frequency
    \param[in]  instance: TIMERx(x=0..13)
    \param[out] none
    \retval     none
*/
uint32_t getTimerClkFrequency(uint32_t instance)
{
    rcu_clock_freq_enum timerclkSrc =  NC;
    uint32_t APBx_PSC = 0;
    uint32_t clk_src = 0;

    if (instance != (uint32_t) NC) {
        switch ((uint32_t)instance) {
#if defined(TIMER0)
            case (uint32_t)TIMER0:
#endif
#if defined(TIMER7)
            case (uint32_t)TIMER7:
#endif
#if defined(TIMER8)
            case (uint32_t)TIMER8:
#endif
#if defined(TIMER9)
            case (uint32_t)TIMER9:
#endif
#if defined(TIMER10)
            case (uint32_t)TIMER10:
#endif
                timerclkSrc = CK_APB2;
                APBx_PSC = (RCU_CFG0 & RCU_CFG0_APB2PSC) >> 11;
                break;
#if defined(TIMER1)
            case (uint32_t)TIMER1:
#endif
#if defined(TIMER2)
            case (uint32_t)TIMER2:
#endif
#if defined(TIMER3)
            case (uint32_t)TIMER3:
#endif
#if defined(TIMER4)
            case (uint32_t)TIMER4:
#endif
#if defined(TIMER5) && !defined(NO_TIMER_5)
            case (uint32_t)TIMER5:
#endif
#if defined(TIMER6)
            case (uint32_t)TIMER6:
#endif
#if defined(TIMER11)
            case (uint32_t)TIMER11:
#endif
#if defined(TIMER12)
            case (uint32_t)TIMER12:
#endif
#if defined(TIMER13)
            case (uint32_t)TIMER13:
#endif
#if defined(TIMER14)
            case (uint32_t)TIMER14:
#endif
#if defined(TIMER15)
            case (uint32_t)TIMER15:
#endif
#if defined(TIMER16)
            case (uint32_t)TIMER16:
#endif
                timerclkSrc = CK_APB1;
                APBx_PSC = (RCU_CFG0 & RCU_CFG0_APB1PSC) >> 8;
                break;
            default:
                break;
        }
    }
    if (0 != (APBx_PSC & 0x04)) {
        clk_src = 2 * rcu_clock_freq_get(timerclkSrc);
    } else {
        clk_src =  rcu_clock_freq_get(timerclkSrc);
    }
    return clk_src;
}

/*!
    \brief      get timer update IRQn
    \param[in]  tim: TIMERx(x=0..13)
    \param[out] none
    \retval     timer update IRQn
*/
IRQn_Type getTimerUpIrq(uint32_t tim)
{
    IRQn_Type IRQn = NonMaskableInt_IRQn;

