CommunityGD32Cores/ArduinoCore-GD32/cores/arduino/gd32/timer.c
    if (tim != (uint32_t)NC) {
        switch ((uint32_t)tim) {
#if defined(TIMER0)
            case (uint32_t)TIMER0:
                //differing update interrupt for Timer0 on some devices
                IRQn = TIMER0_Update_IRQ_Name;
                break;
#endif
#if defined(TIMER1)
            case (uint32_t)TIMER1:
                IRQn = TIMER1_IRQn;
                break;
#endif
#if defined(TIMER2)
            case (uint32_t)TIMER2:
                IRQn = TIMER2_IRQn;
                break;
#endif
#if defined(TIMER3)
            case (uint32_t)TIMER3:
                IRQn = TIMER3_IRQn;
                break;
#endif
#if defined(TIMER4)
            case (uint32_t)TIMER4:
                IRQn = TIMER4_IRQn;
                break;
#endif
#if defined(TIMER5) && !defined(NO_TIMER_5)
            case (uint32_t)TIMER5:
                IRQn = TIMER5_IRQ_Name;
                break;
#endif
#if defined(TIMER6)
            case (uint32_t)TIMER6:
                IRQn = TIMER6_IRQn;
                break;
#endif
#if defined(TIMER7)
            case (uint32_t)TIMER7:
                IRQn = TIMER7_UP_IRQ_NAME;
                break;
#endif
#if defined(TIMER8) && defined(HAS_TIMER_8)
            case (uint32_t)TIMER8:
                IRQn = TIMER8_IRQn;
                break;
#endif
#if defined(TIMER9) && defined(HAS_TIMER_9)
            case (uint32_t)TIMER9:
                IRQn = TIMER9_IRQn;
                break;
#endif
#if defined(TIMER10) && defined(HAS_TIMER_10)
            case (uint32_t)TIMER10:
            #ifdef TIMER10_IRQ_NAME //TODO: repeat this for other timers...
                IRQn = TIMER10_IRQ_NAME;
            #else
                IRQn = TIMER10_IRQn;
            #endif
                break;
#endif
#if defined(TIMER11) && defined(HAS_TIMER_11)
            case (uint32_t)TIMER11:
                IRQn = TIMER11_IRQn;
                break;
#endif
#if defined(TIMER12) && defined(HAS_TIMER_12)
            case (uint32_t)TIMER12:
                IRQn = TIMER12_IRQn;
                break;
#endif
#if defined(TIMER13) && defined(HAS_TIMER_13)
            case (uint32_t)TIMER13:
                IRQn = TIMER13_IRQn;
                break;
#endif
#if defined(TIMER14)
            case (uint32_t)TIMER14:
                IRQn = TIMER14_IRQn;
                break;
#endif
#if defined(TIMER15)
            case (uint32_t)TIMER15:
                IRQn = TIMER15_IRQn;
                break;
#endif
#if defined(TIMER16)
            case (uint32_t)TIMER16:
                IRQn = TIMER16_IRQn;
                break;
#endif
            default:
                break;
        }
    }
    return IRQn;
}

/*!
    \brief      get timer capture/compare IRQn
    \param[in]  tim: TIMERx(x=0..13)
    \param[out] none
    \retval     timer capture/compare IRQn
*/
IRQn_Type getTimerCCIrq(uint32_t tim)
{
    IRQn_Type IRQn = NonMaskableInt_IRQn;

    if (tim != (uint32_t)NC) {
        switch ((uint32_t)tim) {
#if defined(TIMER0)
            case (uint32_t)TIMER0:
                IRQn = TIMER0_Channel_IRQn;
                break;
#endif
#if defined(TIMER1)
            case (uint32_t)TIMER1:
                IRQn = TIMER1_IRQn;
                break;
#endif
#if defined(TIMER2)
            case (uint32_t)TIMER2:
                IRQn = TIMER2_IRQn;
                break;
#endif
#if defined(TIMER3)
            case (uint32_t)TIMER3:
                IRQn = TIMER3_IRQn;
                break;
#endif
#if defined(TIMER4)
            case (uint32_t)TIMER4:
                IRQn = TIMER4_IRQn;
                break;
#endif
#if defined(TIMER5) && !defined(NO_TIMER_5)
            case (uint32_t)TIMER5:
                IRQn = TIMER5_IRQ_Name;
                break;
#endif
#if defined(TIMER6)
            case (uint32_t)TIMER6:
                IRQn = TIMER6_IRQn;
                break;
#endif
#if defined(TIMER7)
            case (uint32_t)TIMER7:
                IRQn = TIMER7_IRQ_NAME;
                break;
#endif
#if defined(TIMER8) && defined(HAS_TIMER_8)
            case (uint32_t)TIMER8:
                IRQn = TIMER8_IRQn;
                break;
#endif
#if defined(TIMER9) && defined(HAS_TIMER_9)
            case (uint32_t)TIMER9:
                IRQn = TIMER9_IRQn;
                break;
#endif
#if defined(TIMER10) && defined(HAS_TIMER_10)
            case (uint32_t)TIMER10:
                IRQn = TIMER10_IRQn;
                break;
#endif
#if defined(TIMER11) && defined(HAS_TIMER_11)
            case (uint32_t)TIMER11:
                IRQn = TIMER11_IRQn;
                break;
#endif
#if defined(TIMER12) && defined(HAS_TIMER_12)
            case (uint32_t)TIMER12:
                IRQn = TIMER12_IRQn;
                break;
#endif
#if defined(TIMER13) && defined(HAS_TIMER_13)
            case (uint32_t)TIMER13:
                IRQn = TIMER13_IRQn;
                break;
#endif
#if defined(TIMER14)
            case (uint32_t)TIMER14:
                IRQn = TIMER14_IRQn;
                break;
#endif
#if defined(TIMER15)
            case (uint32_t)TIMER15:
                IRQn = TIMER15_IRQn;
                break;
#endif
#if defined(TIMER16)
            case (uint32_t)TIMER16:
                IRQn = TIMER16_IRQn;
                break;
#endif
            default:
                break;
        }
    }
    return IRQn;
}

/*!
    \brief      timer interrupt handler
    \param[in]  timer: TIMERx(x=0..13)
    \param[out] none
    \retval     none
*/
void timerinterrupthandle(uint32_t timer)
{
    if (timer_interrupt_flag_get(timer, TIMER_INT_FLAG_UP) != RESET) {
        timer_interrupt_flag_clear(timer, TIMER_INT_FLAG_UP);
        if (timerHandle.interruptHandle) {
            timerHandle.interruptHandle(timer);
        }
    } else if (timer_interrupt_flag_get(timer, TIMER_INT_FLAG_CH0) != RESET) {
        timer_interrupt_flag_clear(timer, TIMER_INT_FLAG_CH0);
        if (pwmHandle.interruptHandle) {
            pwmHandle.interruptHandle(timer, TIMER_CH_0);
        }
        if (timerHandle.captureInterruptHandle[0]) {
            timerHandle.captureInterruptHandle[0](timer, 0);
        }
    } else if (timer_interrupt_flag_get(timer, TIMER_INT_FLAG_CH1) != RESET) {
        timer_interrupt_flag_clear(timer, TIMER_INT_FLAG_CH1);
        if (pwmHandle.interruptHandle) {
            pwmHandle.interruptHandle(timer, TIMER_CH_1);
        }
        if (timerHandle.captureInterruptHandle[1]) {
            timerHandle.captureInterruptHandle[1](timer, 1);
        }
    } else if (timer_interrupt_flag_get(timer, TIMER_INT_FLAG_CH2) != RESET) {
        timer_interrupt_flag_clear(timer, TIMER_INT_FLAG_CH2);
        if (pwmHandle.interruptHandle) {
            pwmHandle.interruptHandle(timer, TIMER_CH_2);
        }
        if (timerHandle.captureInterruptHandle[2]) {
            timerHandle.captureInterruptHandle[2](timer, 2);
        }
    } else if (timer_interrupt_flag_get(timer, TIMER_INT_FLAG_CH3) != RESET) {
        timer_interrupt_flag_clear(timer, TIMER_INT_FLAG_CH3);
        if (pwmHandle.interruptHandle) {
            pwmHandle.interruptHandle(timer, TIMER_CH_3);
        }
        if (timerHandle.captureInterruptHandle[3]) {
            timerHandle.captureInterruptHandle[3](timer, 3);
        }
    }
}

#if defined(TIMER0)
void TIMER0_IRQHandler(void)
{
    timerinterrupthandle(TIMER0);
#if defined(TIMER9)
    timerinterrupthandle(TIMER9);
#endif
}

void TIMER0_Channel_IRQHandler(void)
{
    timerinterrupthandle(TIMER0);
}

/* some devices have this. */
void TIMER0_BRK_UP_TRG_COM_IRQHandler(void)
{
    timerinterrupthandle(TIMER0);
}

void TIMER0_UP_TIMER9_IRQHandler(void)
{
    timerinterrupthandle(TIMER0);
#if defined(TIMER9)
    timerinterrupthandle(TIMER9);
#endif
}

void TIMER0_UP_IRQHandler(void)
{
    timerinterrupthandle(TIMER0);
}

#endif /* TIMER0/TIMER9 handler */

